LAutour/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053.cpp
//переключение DMA вывода на строку
IRAM_ATTR void MatrixPanel_I2S_DMA::sendCBRow(uint8_t buff_id)
{
  //данные строки на бак-суффикс
  dmadesc_ext[ICN2053_EXT_DATA].qe.stqe_next = &dmadesc_suffix[cur_suffix_id][data_to_suffix];
  //закольцовываем бак-суффикс
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_suffix[cur_suffix_id];
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;
  //меняем cur_suffix_id
  cur_suffix_id ^= 1;
  //фронт-суффикс на данные строки;
  dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].qe.stqe_next = dmadesc_data[buff_id];
  //ждем прерывания окончания передачи фронт-суффикса и данных строки
  dma_int_cnt = -1;
  //dmadesc_suffix[cur_suffix_id][desc_suffix_cnt-1].eof = true;
}

//обработчик вывода строк
IRAM_ATTR void MatrixPanel_I2S_DMA::sendCallback()
{
  static uint8_t dma_buffer_id = 0;
  if (bufferBusy || bufferReady || dma_int_cnt > 0) return;
  bufferBusy = true;
  dma_int_cnt++;

  if (dma_int_cnt > 0) 
  {
    dmadesc_suffix[cur_suffix_id^1][desc_suffix_cnt-1].eof = false;
    //dma_int_cnt = 0;  

    //Serial.print(rows_send_cnt);
    if (rows_send_cnt > 0)
    {      
      int row_send_idx = rows_send_cnt-1;
      //отправка строк DMA буфера   
      //m_cfg.double_dma_buff = false;
      if (m_cfg.double_dma_buff)
      {         
        //двойной буфер строк
        if (rows_send_cnt == rows_per_frame) 
        {
          //готовим первый DMA буфер
          prepareDmaRows(row_send_idx, dma_buffer_id);
          //выводим первый DMA буфер
          sendCBRow(dma_buffer_id);
          dma_buffer_id ^= 1;
        }else 
        {
          //выводим другой DMA буфер
          sendCBRow(dma_buffer_id^1);
        }
        if (rows_send_cnt > dma_buff.row_data_cnt) 
        {
          //готовим очередной DMA буфер
          prepareDmaRows(row_send_idx - dma_buff.row_data_cnt, dma_buffer_id);
          dma_buffer_id ^= 1;
        }        
      }else
      {
        //одиночный буфер строк
        //готовим строку
        prepareDmaRows(row_send_idx, 0);
        //выводим строку
        sendCBRow(0);
      }

      rows_send_cnt -= dma_buff.row_data_cnt; 
      if (rows_send_cnt <= 0) 
      {
        icn2053_clear = false;
        //автовывод изобржения при icn2053_auto_vsync = 1
        if (icn2053_auto_vsync) rows_send_cnt = 0;
        else rows_send_cnt = -1;
        dma_int_cnt = -4; //костыль при DMA_CLOCK > 5Mhz- надо разбираться
      }
    }else if (rows_send_cnt == 0)
    {
      //отправка синхры после отправки строк DMA буфера
      sendCBVsync();
      //Serial.print("*");
      rows_send_cnt = -1;
    }else
    {
      //DMA свободен
      bufferReady = true; 
    }
  }
  bufferBusy= false;
}

//обработчик прерывания от DMA
//разрешается в начале DMA посылки (EOF)
//срабатывает в конце посылки
IRAM_ATTR void icn2053i2sCallback()
{ 
  MatrixPanel->sendCallback();
}


//ожидание готовности DMA
void MatrixPanel_I2S_DMA::waitDmaReady()
{
  if (frame_buffer.len == 0) return;
  while(!bufferReady)
  {
    delay(1);
  }  
}

//вывод VSYNC (комнад и регистров управления драйверами)
void MatrixPanel_I2S_DMA::sendVsync()
{
  waitDmaReady();
  bufferReady = false; //резервируем DMA
  bufferBusy = true; //маскируем обработчик вывода строк  
  sendCBVsync();  
  bufferBusy = false;

}

//запуск отправки фрейма в back-буфер драйверов
void MatrixPanel_I2S_DMA::sendFrame(bool waitSend, bool autoVsync)
{
  waitDmaReady();
  //Serial.print(">");
  //Serial.print(m2-m1);Serial.print(" ");
  bufferReady = false; //резервируем DMA
  dma_int_cnt = 0;
  icn2053_auto_vsync = autoVsync;
  dmadesc_suffix[cur_suffix_id^1][desc_suffix_cnt-1].eof = true; //разрешаем прерывания
  rows_send_cnt = rows_per_frame; //инициализируем счетчик вывода строк
  //Serial.print(">");Serial.println(back_buffer_id^1);
  if (waitSend) waitDmaReady();
}

//инициализация регистров управления драйверами с очисткой экрана
void MatrixPanel_I2S_DMA::icn2053init()
{
  icn2053setVSync(false, true); //запретить вывод изображения
  for (int i = 0; i < ICN2053_REG_CNT; i++)
  {
    sendVsync();
    //Serial.println(F("4"));
  }
  //один буфер драйвера
  icn2053_clear= true;
  sendFrame();
  //второй буфер драйвера
  icn2053_clear= true;
  sendFrame();  
  icn2053setVSync(true, true); //разрешить вывод изображения
  sendVsync();
}

bool MatrixPanel_I2S_DMA::allocateDMAmemory()
{
  /***
  * Step 1: Look at the overall DMA capable memory for the DMA FRAMEBUFFER data only (not the DMA linked list descriptors yet) 
  *         and do some pre-checks.
  */
  //size_t row_data_buffer_size;
  size_t matrix_buffer_size = 0;
  size_t subrow_data_len = pixels_per_row + SUBROW_ADD_LEN; //длина подстроки
  size_t gamma_table_len = 0;
  uint8_t buff_cnt; //общее количество DMA буферов

  m_cfg.double_buff &= 1;
  m_cfg.double_dma_buff &= 1;
  if (m_cfg.driver == ICN2053)
  { 
    //двойной видеобуфер встроен в драйвер матрицы, переключение по V_SYNC c инициализацией одного из регистров    
    //переключение буфера драйвера матрицы совмещеено с передайче регистров
    back_buffer_id = m_cfg.double_buff;
    gamma_table_len = BRIGHT_TABLE_SIZE;

    //буфер префикса   
    dma_buff.frame_prefix_len = FRAME_ADD_LEN + ICN2053_PREFIX_START_LEN + pixels_per_row;
    dma_buff.frame_prefix_cnt = ICN2053_PREFIX_CNT; //V_SYNC + уствновка регистров
    //буфера суффикса
    dma_buff.frame_suffix_len = ICN2053_ROW_OE_LEN*rows_per_frame; //*2 - фронт+спад    
    dma_buff.frame_suffix_cnt = ICN2053_SUFFIX_CNT; //перебор строк
    //буфера строк   
    dma_buff.row_data_len = subrow_data_len*DRIVER_BITS + ROW_ADD_LEN;
    //размер первичного видеобуфера и числа строк данных
    dma_buff.row_data_cnt = ICN2053_DMA_ROW_BUFF_CNT;
    if (dma_buff.row_data_cnt > rows_per_frame) dma_buff.row_data_cnt = rows_per_frame;
 
    dma_buff.color_bits = -m_cfg.color_depth;
    //требуется промежуточный видеобуфер без требования DMA
    #ifdef SERIAL_DEBUG
		Serial.printf_P(PSTR("Color depth id = %d\r\n"), dma_buff.color_bits);
    #endif
      
    switch (dma_buff.color_bits)
    {
      #ifdef USE_COLORx16
      case -16:
        //двухбайтовое поле
        frame_buffer.row_len = (pixels_per_row*2 + VB_SIZE - 1)/VB_SIZE;
        frame_buffer.subframe_len = frame_buffer.row_len*m_cfg.mx_height;
        frame_buffer.len = frame_buffer.subframe_len;
      break;
      #endif
      default:
        //обработка буфера на стороне пользователя
        frame_buffer.row_len = 0;
      break; 
    }
    //начало вычисления размера общего буфера
    buff_cnt = ICN2053_PREFIX_CNT + ICN2053_SUFFIX_CNT;
    matrix_buffer_size = (dma_buff.frame_prefix_len*ICN2053_PREFIX_CNT + dma_buff.frame_suffix_cnt*ICN2053_SUFFIX_CNT)*SIZE_DMA_TYPE;
    matrix_buffer_size <<= m_cfg.double_dma_buff;
  }else if (m_cfg.driver == ICN2038S)
  {
    Serial.println("Support SHIFT drivers - disabled!"); 
    buffersFree();
    return false;
  }
  dma_buff.all_row_data_cnt = dma_buff.row_data_cnt << m_cfg.double_dma_buff;
  buff_cnt += dma_buff.all_row_data_cnt;
  matrix_buffer_size += dma_buff.row_data_len*dma_buff.all_row_data_cnt*SIZE_DMA_TYPE + gamma_table_len;
  
  size_t heap_free_size = heap_caps_get_free_size(MALLOC_CAP_DMA);
	// 1. Calculate the amount of DMA capable memory that's actually available
  #ifdef SERIAL_DEBUG    
  if (m_cfg.double_dma_buff) 
  {
    Serial.println(F("DOUBLE FRAME BUFFERS / DOUBLE BUFFERING IS ENABLED. DOUBLE THE RAM REQUIRED!"));
  }        
  Serial.println(F("DMA memory blocks available before any malloc's: "));
  heap_caps_print_heap_info(MALLOC_CAP_DMA);
	Serial.println(F("******************************************************************"));
  Serial.printf_P(PSTR("We're going to need %d bytes of SRAM just for the frame buffer(s).\r\n"), matrix_buffer_size);    
  Serial.printf_P(PSTR("The total amount of DMA capable SRAM memory is %d bytes.\r\n"), heap_free_size);
  Serial.printf_P(PSTR("Largest DMA capable SRAM memory block is %d bytes.\r\n"), heap_caps_get_largest_free_block(MALLOC_CAP_DMA)); 
  if (m_cfg.driver == ICN2053)          
	Serial.println(F("******************************************************************"));	    		
  #endif

  // Can we potentially fit the framebuffer into the DMA capable memory that's available?
  if ( heap_free_size < matrix_buffer_size  ) 
  {      
    #ifdef SERIAL_DEBUG      
    Serial.printf_P(PSTR
      ("######### Insufficient memory for requested resolution. Reduce MATRIX_COLOR_DEPTH and try again.\r\n\tAdditional %d bytes of memory required.\r\n\r\n"), 
      (matrix_buffer_size-heap_caps_get_free_size(MALLOC_CAP_DMA)) );
    #endif
    return false;
  }
  dma_buff.rowBits = (ESP32_I2S_DMA_STORAGE_TYPE**)heap_caps_calloc(buff_cnt,sizeof(void*), MALLOC_CAP_32BIT | MALLOC_CAP_DMA);
  if (dma_buff.rowBits == NULL)
  {
    #ifdef SERIAL_DEBUG
		Serial.printf_P(PSTR("ERROR: Couldn't malloc frameBits ptrs %d! Critical fail.\r\n"), (uint32_t)dma_buff.rowBits);
    #endif
    return false;
  }

  size_t data_len = dma_buff.row_data_len;
  //выделяем DMA буфер на строки
	for (int malloc_num = 0; malloc_num < buff_cnt; malloc_num++)
	{
    #ifdef SERIAL_DEBUG
		Serial.print("Malloc memory for ");
    #endif
    //тут оптимизация под то, что служебных буферов не более двух
    if (malloc_num >= dma_buff.all_row_data_cnt)
    {
      if (malloc_num < (dma_buff.all_row_data_cnt + dma_buff.frame_prefix_cnt))
      {
        data_len = dma_buff.frame_prefix_len;
        #ifdef SERIAL_DEBUG
		    Serial.print("Prefix");
        #endif
      }
      else 
      {
        data_len = dma_buff.frame_suffix_len;
        #ifdef SERIAL_DEBUG
		    Serial.print("Suffix");
        #endif
      }
    }else
    {
      #ifdef SERIAL_DEBUG
		  Serial.print("Row");
      #endif
    }
    dma_buff.rowBits[malloc_num] = (ESP32_I2S_DMA_STORAGE_TYPE*)heap_caps_calloc(data_len, SIZE_DMA_TYPE,  MALLOC_CAP_DMA);

    if (dma_buff.rowBits[malloc_num] == NULL)
    {
      #ifdef SERIAL_DEBUG
		  Serial.printf_P(PSTR(" - ERROR: Couldn't malloc DMA buffer %d! Critical fail.\r\n"), malloc_num);
      #endif
      buffersFree();
    	return false;
    }
    #ifdef SERIAL_DEBUG
    Serial.printf_P(PSTR(": %d bytes @ address %u(d) (DMA buffer %d).\r\n"), data_len*SIZE_DMA_TYPE, (uint32_t)dma_buff.rowBits[malloc_num], malloc_num);
    #endif
	}
  //выделяем не DMA первичный буфер для ICN2053
  if (frame_buffer.len > 0)
  {
    for (int frame_id = m_cfg.double_buff; frame_id >= 0; frame_id--)
    {
      #ifdef SERIAL_DEBUG
		  Serial.printf_P(PSTR("Malloc memory for primary framebuffer %d"), frame_id);
      #endif

