LAutour/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053.cpp
  if (m_cfg.driver == ICN2053)
  {
    #ifdef SERIAL_DEBUG  
    Serial.println("configureDMA(): Link dmadesc_suffix 2.");
    #endif       
    linkDmaDesc_n(dmadesc_suffix[1], NULL, desc_suffix_cnt, 
      (uint8_t**)&dma_buff.rowBits[offset_suffix], dma_buff.frame_suffix_len*SIZE_DMA_TYPE,DMA_MAX, 1);  
    for(int i = ICN2053_DESCEXT_CNT-1; i >= 0; i--)
    {
      //только для инициализации всех полей дескрипторов
      link_dma_desc(&dmadesc_ext[i], NULL, NULL, 0);
    }
    //подготовка регистров конфигурации
    driver_reg = (driver_rgb_t*)heap_caps_calloc(ICN2053_REG_CNT, sizeof(driver_rgb_t), MALLOC_CAP_8BIT);
    if (driver_reg == NULL)
    {
      buffersFree();
      return;
    }
    memcpy(driver_reg, ICN2053_REG_VALUE, ICN2053_REG_CNT*sizeof(driver_rgb_t));
    setDriverRegRGB(&driver_reg[ICN2053_CFG1], (rows_per_frame-1), ICN2053_CFG1_LC_MASK, ICN2053_CFG1_LC_OFFSET);
    icn2053initBuffers(); 
    bufferReady = false;
    bufferBusy = false;
    icn2053_clear = false;
    icn2053_auto_vsync = false;
    getUserRGB = NULL;
    drawUserPixel = NULL;
    driver_cur_reg = 0;
    cur_suffix_id = 0;
    rows_send_cnt = 0;
    dma_int_cnt = 0;
  }else
  {
    //shift
  }
  #ifdef SERIAL_DEBUG  
  Serial.println(F("configureDMA(): Inited buffers.\r\n"));
  #endif       

  //End markers for DMA LL

  #ifdef SERIAL_DEBUG
  Serial.println(F("Performing I2S setup:"));
  #endif

  i2s_parallel_config_t cfg = 
  {
    .gpio_bus = {
      m_cfg.gpio.r1, m_cfg.gpio.g1, m_cfg.gpio.b1, 
      m_cfg.gpio.r2, m_cfg.gpio.g2, m_cfg.gpio.b2, 
      m_cfg.gpio.lat, m_cfg.gpio.oe, 
      m_cfg.gpio.a, m_cfg.gpio.b, m_cfg.gpio.c, m_cfg.gpio.d, m_cfg.gpio.e, 
      -1, -1, -1},
    .gpio_clk = m_cfg.gpio.clk,
    .sample_rate = m_cfg.i2sspeed,   
    .sample_width = ESP32_I2S_DMA_MODE,        
    .desccount_a = desc_data_cnt, //использовать только для SHIFT драйверов
    .lldesc_a = dmadesc_data[0],  //      
    .desccount_b = desc_data_cnt, //использовать только для SHIFT драйверов
    .lldesc_b = dmadesc_data[1],  //использовать только для SHIFT драйверов
    .clkphase = m_cfg.clk_phase
  };

  //для Call обработчика DMA  
  MatrixPanel = this;
  // Setup I2S 
  esp_err_t res = i2s_parallel_driver_install(I2S_NUM_1, &cfg);
  if (res != ESP_OK)
  {
    #ifdef SERIAL_DEBUG
    Serial.println("Error setup I2S");  
    #endif
    buffersFree();
    return;
  }
  negative_panel = false;
  scroll_y = 0;
  scroll_x = 0;
  CurColor = 0;
  CurRGB.r = 0;
  CurRGB.g = 0;
  CurRGB.b = 0;

  #ifdef SERIAL_DEBUG
  Serial.println(F("Installed."));
  #endif
  initialized = true;	
  if (m_cfg.driver == ICN2053)
  {
    setShiftCompleteCallback(&icn2053i2sCallback);
    i2s_parallel_send_dma(I2S_NUM_1, dmadesc_suffix[0]);    
    icn2053init();  
  }else
  {
    return;
    //shift
  }

  #ifdef SERIAL_DEBUG  
  Serial.println(F("configureDMA(): DMA setup completed on I2S1.")); 
  #endif         
  initialized = true;	  
  setPanelBrightness(brightness);
} // end initMatrixDMABuff


void MatrixPanel_I2S_DMA::fillRectFrameBuffer(int16_t x1, int16_t y1, int16_t x2, int16_t y2)
{
  uniptr_t addr;
  int offset_y = y1*frame_buffer.row_len;
  int x;
  y2 -= y1;
  x2 -= x1;  
  int16_t _x2 = x2;
  while (y2 >= 0) 
  {
    switch (dma_buff.color_bits)  
    {
      #ifdef USE_COLORx16
      case -16:
        addr.pXX = &frame_buffer.frameBits[back_buffer_id][offset_y];
      break;
      #endif
    } 
    x = x1;
    while (x2 >= 0) 
    {
      switch (dma_buff.color_bits)  
      {
        #ifdef USE_COLORx16
        case -16:
          addr.p16[x] = (uint16_t)CurColor;
        break;
        #endif
        default:
          drawUserPixel(x1,y1,CurRGB);
        break;
      } 
      x++;
      x2--;
    }
    y1++;
    offset_y += frame_buffer.row_len;
    x2 = _x2;
    y2--;
  }
}

void MatrixPanel_I2S_DMA::fillRectBuffer(int16_t x, int16_t y, int16_t w, int16_t h)
{
  if ( !initialized ) 
  { 
    #ifdef SERIAL_DEBUG 
    Serial.println(F("Cannot updateMatrixDMABuffer as setup failed!"));
    #endif         
    return;
  }
  if (x >= pixels_per_row || y >= m_cfg.mx_height) 
  {
    return;
  }
  int16_t x2 = x + w - 1;
  int16_t y2 = y + h - 1;
  if (x2 < 0|| y2 < 0) 
  {
    return; 
  }
  if (x < 0) x = 0;
  if (x2 >= pixels_per_row) x2 = pixels_per_row - 1;
  if (y2 >= m_cfg.mx_height) y2 = m_cfg.mx_height - 1;
  
  if (frame_buffer.len != 0)
  {
    if (!m_cfg.double_buff) 
      waitDmaReady(); //первичный буфер без двойной буферизации, нужно ждать конца его вывода
    fillRectFrameBuffer(x, y, x2, y2);    
  }else
  {
    //shift
    //fillRectDMABuffer(x, y, x2, y2);
  }
}

void MatrixPanel_I2S_DMA::clearDmaBuffer(uint8_t _buff_id)
{
  int y_max, y_min;
  _buff_id &= m_cfg.double_dma_buff;
  if (_buff_id) 
  {
    y_max = dma_buff.all_row_data_cnt - 1; 
    y_min = dma_buff.all_row_data_cnt >> 1;
  }else 
  {
    y_max = (dma_buff.all_row_data_cnt >> 1) - 1; 
    y_min = 0;
  }
  for (int y = y_max; y >= y_min; y--)
  {
    for (int x = dma_buff.row_data_len - 1; x >= 0; x--)
    {
      dma_buff.rowBits[y][x] &= ~BITMASK_RGB12;
    }
  }
}


void MatrixPanel_I2S_DMA::clearBuffer(uint8_t _buff_id)
{  
  _buff_id &= 1;
  uint8_t clear_buff_idx = m_cfg.double_buff & (back_buffer_id^_buff_id^1);
  if (frame_buffer.len != 0)
  {    
    if (initialized &(_buff_id == 0))
    {
      panelShowOff();
      //запускаем очистку первого фрейма в памяти драйверов экрана
      waitDmaReady();
      icn2053_clear = true;
      sendFrame();
    }
    if (!m_cfg.double_buff)
      waitDmaReady();
    //очистка первичного видеобуфер параллельно с DMA очисткой драйверов экрана
    memset((uint8_t*)frame_buffer.frameBits[clear_buff_idx], 0, frame_buffer.len * VB_SIZE);
    if (initialized &(_buff_id == 0))
    {      
      //запускаем очистку второго фрейма в памяти драйверов экрана
      waitDmaReady();
      icn2053_clear = true;
      sendFrame();
      panelShowOn();
    }    
  }else
  {
    //shift
    //clearDmaBuffer(clear_buff_idx);
  }
}

MatrixPanel_I2S_DMA::MatrixPanel_I2S_DMA(bool Virtual):
  #if defined(USE_GFX_ROOT)
  GFX(MATRIX_WIDTH, MATRIX_HEIGHT)
  #elif !defined(NO_GFX)
  Adafruit_GFX((Virtual)?(PANEL_WIDTH*PANEL_COUNT_X):(PANEL_WIDTH*PANEL_COUNT_X*PANEL_COUNT_Y), 
  (Virtual)?(PANEL_HEIGHT*PANEL_COUNT_Y):(PANEL_HEIGHT))
  #endif
{
  memcpy(&m_cfg, &hub75_i2s_cfg_default, sizeof(hub75_i2s_cfg_t));
}

//MatrixPanel_I2S_DMA 
//@param  {HUB75_I2S_CFG} opts : structure with matrix configuration
MatrixPanel_I2S_DMA::MatrixPanel_I2S_DMA(const hub75_i2s_cfg_t& opts,bool Virtual):
  #if defined(USE_GFX_ROOT) 
  GFX(opts.mx_width*opts.chain_length, opts.mx_height),
  #elif !defined(NO_GFX)
  Adafruit_GFX((Virtual)?(opts.mx_width*opts.chain_length_x):(opts.mx_width*opts.chain_length_x*opts.chain_length_y), 
               (Virtual)?(opts.mx_height*opts.chain_length_y):(opts.mx_height)),
  #endif        
  m_cfg(opts)
{    
}

