LAutour/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053/ESP32-HUB75-MatrixPanel-I2S-DMA-icn2053.cpp
const hub75_i2s_cfg_t& MatrixPanel_I2S_DMA::getCfg() const 
{
  return m_cfg;
};


bool MatrixPanel_I2S_DMA::begin()
{
  // Change 'if' to '1' to enable, 0 to not include this Serial output in compiled program        
  #ifdef SERIAL_DEBUG       
  Serial.printf_P(PSTR("Using pin %d for the R1_PIN\n"), m_cfg.gpio.r1);
  Serial.printf_P(PSTR("Using pin %d for the G1_PIN\n"), m_cfg.gpio.g1);
  Serial.printf_P(PSTR("Using pin %d for the B1_PIN\n"), m_cfg.gpio.b1);
  Serial.printf_P(PSTR("Using pin %d for the R2_PIN\n"), m_cfg.gpio.r2);
  Serial.printf_P(PSTR("Using pin %d for the G2_PIN\n"), m_cfg.gpio.g2);
  Serial.printf_P(PSTR("Using pin %d for the B2_PIN\n"), m_cfg.gpio.b2);
  Serial.printf_P(PSTR("Using pin %d for the A_PIN\n"), m_cfg.gpio.a);
  Serial.printf_P(PSTR("Using pin %d for the B_PIN\n"), m_cfg.gpio.b);
  Serial.printf_P(PSTR("Using pin %d for the C_PIN\n"), m_cfg.gpio.c);
  Serial.printf_P(PSTR("Using pin %d for the D_PIN\n"), m_cfg.gpio.d);
  Serial.printf_P(PSTR("Using pin %d for the E_PIN\n"), m_cfg.gpio.e);
  Serial.printf_P(PSTR("Using pin %d for the LAT_PIN\n"), m_cfg.gpio.lat);
  Serial.printf_P(PSTR("Using pin %d for the OE_PIN\n"),  m_cfg.gpio.oe);
  Serial.printf_P(PSTR("Using pin %d for the CLK_PIN\n"), m_cfg.gpio.clk);
  #endif   

  pixels_per_row = m_cfg.mx_width*m_cfg.chain_length_x*m_cfg.chain_length_y;
  rows_per_frame = m_cfg.mx_height/ROWS_IN_PARALLEL;
  driver_cnt = pixels_per_row/DRIVER_BITS;
  brightness = BRIGHTNESS_DEFAULT;

  /* As DMA buffers are dynamically allocated, we must allocated in begin()
  * Ref: https://github.com/espressif/arduino-esp32/issues/831
  */
  if ( !allocateDMAmemory() ) 
  {  
    return false; 
  } // couldn't even get the basic ram required.

  // Flush the DMA buffers prior to configuring DMA - Avoid visual artefacts on boot.
  //clearScreen(); // Must fill the DMA buffer with the initial output bit sequence or the panel will display garbage
  // Setup the ESP32 DMA Engine. Sprite_TM built this stuff.
  configureDMA(); //DMA and I2S configuration and setup

  #ifdef SERIAL_DEBUG 
  if (!initialized)    
    Serial.println(F("MatrixPanel_I2S_DMA::begin() failed."));
  #endif      

  return initialized;
}

void MatrixPanel_I2S_DMA::stopDMAoutput() 
{  
  clearScreen();
  i2s_parallel_stop_dma(I2S_NUM_1);
} 

//overload for compatibility
bool MatrixPanel_I2S_DMA::begin(hub75_pins_t* hub75_pins_ptr)
{
  // RGB
  memcpy(&m_cfg.gpio, hub75_pins_ptr, sizeof(hub75_pins_t));
  return begin();
}

IRAM_ATTR void MatrixPanel_I2S_DMA::flipDMABuffer() 
{         
  if (!m_cfg.double_buff)
  {
    if (frame_buffer.len != 0) sendFrame();
  }else
  {
    #ifdef SERIAL_DEBUG     
    //Serial.printf_P(PSTR("Set show buffer to: %d\n"), back_buffer_id);
    #endif      
    if (frame_buffer.len != 0)
    {
      //waitDmaReady();
      waitDmaReady();
      back_buffer_id ^= 1;
      sendFrame();
    }else
    {
      //shift
    }
  }      
}

void MatrixPanel_I2S_DMA::setPanelBrightness(int b)
{
  if (!initialized) return;
  waitDmaReady();
  #ifdef SERIAL_DEBUG 
    Serial.print("Set brightness ");
    Serial.println(b);
  #endif    
  //Serial.println(b);
  if (brightness_table != NULL)
  {
    uint32_t g;    
    for(int i = BRIGHT_TABLE_SIZE-1; i >= 0; i--)
    {
      brightness_table[i] = (lumConvTab[b]|(lumConvTab[b]<<8))*i/(BRIGHT_TABLE_SIZE-1);
    }
  }else
  {
    //shift
  }  
}

void MatrixPanel_I2S_DMA::setBrightness8(uint8_t b)
{
  brightness = b;
  setPanelBrightness(b);
}

void MatrixPanel_I2S_DMA::setNegative(bool negative, bool autoSend)
{
  waitDmaReady();
  negative_panel = negative;
  if (autoSend) sendFrame();
}

void MatrixPanel_I2S_DMA::setDMAGetUserRGB(getUserRGB_p _getUserRGB)
{
  getUserRGB = _getUserRGB;
}

void MatrixPanel_I2S_DMA::setDrawUserPixel(drawUserPixel_p _drawUserPixel)
{
  drawUserPixel = _drawUserPixel;
}
